source/backend/controllers/AnswersController.php

SELECT * FROM `answers` WHERE `id`='168'
---
    protected function findModel($id)
    {
        if (($model = Answers::findOne($id)) !== null) {