source/backend/views/answers/index.php

SELECT * FROM `user`
---
						[
							'attribute' => 'user_id',
							'value' 	=> 'user.username',
							'filter'=>ArrayHelper::map(User::find()->asArray()->all(), 'id', 'username'),