source/frontend/controllers/AnswerController.php

SELECT `question_id` FROM `user_question_pass`
---
    public function actionIndex()
    {
        $question_pass = UserQuestionPass::find()
        ->select('question_id')
        ->all();

SELECT * FROM `answers` WHERE `id`=137
---
    public function actionDetail($id)
    {
		$id = intval($id) < 0 ? 0 : intval($id);
		if($id==0)
		{
			throw new \yii\web\NotFoundHttpException('The requested page does not exist.');
		}
		$model = Answers::findOne($id);