source/frontend/controllers/QuestionController.php

	public function actionAnswered($slug)
    {
        $model = Questions::find()->where(['slug' => $slug])->one();
        if (empty($model)) {
            throw new NotFoundHttpException();
        }
        /** LAY CAU TRA LOI**/
        $sqlAnswerQuestion = Answers::find()
        ->where([
            "question_id"=>$model->id,
            "status"     => Answers::IS_ACTIVE
        ]);
        $dataProviderAnswerQuestion = new ActiveDataProvider([
            'query' => $sqlAnswerQuestion,
            'pagination' => [
                'pageSize' => 5,
            ],
            'sort'=> [
                'defaultOrder' => ['id' => SORT_DESC]
            ]
        ]);
        $totalAnswer = clone $sqlAnswerQuestion;
        /** LAY TOPIC CUNG CAU HOI **/
        $dataIdQuestionTopic    =   QuestionTopic::find()
            ->select('topic_id')
            ->where(["question_id"=>$model->id])
            ->all();
---
SELECT * FROM `questions` WHERE `slug`='cach-tinh-phan-tram-nhu-the-nao-nhanh-va-chinh-xac-nhat'
SELECT `topic_id` FROM `question_topic` WHERE `question_id`=244

            ->select('question_id')
            ->where(['topic_id' => ArrayHelper::getColumn($dataIdQuestionTopic, "topic_id")])
            ->all();
        $dataQuestionRelation = Questions::find()
            ->where(["id" => ArrayHelper::getColumn($dataIdQuestionRelation, "question_id")])
            ->limit(10)
            ->orderBy(["id"=>SORT_DESC])
            ->all();
---
SELECT * FROM `questions` WHERE 0=1 ORDER BY `id` DESC LIMIT 10