source/common/models/Questions.php

    public function getModulehadanswer()
    {
        $numAnswers = self::getAnswers()->count();
---
SELECT COUNT(*) FROM `answers` WHERE `question_id`=326

    public function findQuestionBySlug($slug)
    {
        return Questions::find()->where(['slug' => $slug])->one();
---
SELECT * FROM `questions` WHERE `slug`='xin-huong-dan-minh-cach-doi-hinh-nen-tren-may-tinh-voi-a'