source/common/models/User.php

SELECT * FROM `user` WHERE `slug`='vu-hai-linh'
---
	public function findUserBySlug($slug){
		return User::find()
            ->where(['slug' => $slug])
            ->one();