source/frontend/components/seo/UrlRule.php

SELECT * FROM `questions` WHERE `id`=334
SELECT * FROM `questions` WHERE `id`=244
SELECT * FROM `answers` WHERE `id`=116
---
    public function createUrl($manager, $route, $params)
    {

        if ($route === 'question/unanswered') {
            if (isset($params["id"])) {
				$model = Questions::findOne($params["id"]);
				if (empty($model)) {
					throw new NotFoundHttpException();
				}
                return "/unanswered". '/' . $model->slug;
            }
        }

		if ($route === 'question/answered') {
            if (isset($params['id'])) {
				$model = Questions::findOne($params["id"]);
				if (empty($model)) {
					throw new NotFoundHttpException();
				}
                return "/". $model->slug;
            }
        }

		if ($route === 'answer/detail') {
			$model 	= 	Answers::findOne($params["id"]);

SELECT * FROM `user` WHERE `id`=31
---

		/** THONG TIN TAI KHOAN **/
		if ($route === 'profiles/index') {
			$model 	= 	User::findOne($params["id"]);

SELECT * FROM `answers` WHERE (`question_id`=217) AND (`user_id` IS NULL)
---
			}
			$modelQuestion 	= Questions::findQuestionBySlug($matches["slug"]);
			$modelUser	   	= User::findUserBySlug($matches["user"]);
			$modelAnswer	= Answers::find()->where([
				"question_id"	=>	$modelQuestion->id,
				"user_id"		=> 	$modelUser->id
			])->one();