source/partner/views/answers/_form.php

/* @var $this yii\web\View */
/* @var $model common\models\Answers */
/* @var $form yii\widgets\ActiveForm */
$modelQuestion = Questions::findOne(Yii::$app->request->get("id"));
---
SELECT * FROM `questions` WHERE `id`='336'