source/partner/views/answers/index.php



				<div class="box-body">
				<?= GridView::widget([
					'dataProvider' => $dataProvider,
					'columns' => [
						['class' => 'yii\grid\SerialColumn'],
						[
							'label' => 'Câu hỏi',
							'attribute' => 'title',
						],
						[
							'label' => 'Lượt xem',
							'attribute'	=> 'views',
							'options'=>['width'=>'100px'],
							'value'		=> function($model){
								return count($model["views"]);
							}
						],
						/*[
                            'label' => 'Số câu trả lời',
                            'value' => function ($model) {
                              $modelQuestion = Questions::findOne($model['id']);
							  return count($modelQuestion->answers);
                            }
                        ],*/
---
SELECT * FROM `answers` LIMIT 20
SELECT * FROM `questions` WHERE `id`=0
SELECT COUNT(*) FROM `answers`