source/frontend/widget/WidgetQuestionStatistics.php

SELECT * FROM `questions` WHERE `id`=244
SELECT COUNT(*) FROM `user_question_follow` WHERE `question_id`=244
---
    public function run()
    {
		$modelQuestion 			= Questions::findOne($this->id);
		$numberQuestionFollow 	= UserQuestionFollow::find()->where(["question_id"=>$modelQuestion->id])->count();