source/partner/controllers/AnswersController.php

    public function actionView($id)
    {
		$model = Answers::findOne($id);
		$modelQuestion = Questions::findOne($model->question_id);
---
SELECT * FROM `answers` WHERE `id`='163'
SELECT * FROM `questions` WHERE `id`=330

	public function actionViewquestion($id)
    {
		$model = Questions::findOne($id);
---
SELECT * FROM `questions` WHERE `id`='171'